//=============================================================================
//
// ライト処理 [light.h]
// Author : 相馬靜雅
//
//=============================================================================
#ifndef _LIGHT_H_		// このマクロ定義がされていなかったら
#define _LIGHT_H_		// 二重インクルード防止のマクロを定義する

#include "main.h"

//==========================================================================
// クラス定義
//==========================================================================
// ライトクラス定義
class CLight
{
public:

	CLight();
	~CLight();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

private:

	// マクロ定義
#define MAX_LIGHT	(3)	// ライトの最大数
	
	D3DLIGHT9 m_aLight[MAX_LIGHT];		// ライト構造体
};

#endif