//=============================================================================
// 
//  チュートリアルOKサインヘッダー [tutorialOKsign.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _TUTORIAL_OKSIGN_H_
#define _TUTORIAL_OKSIGN_H_	// 二重インクルード防止

#include "main.h"
#include "object2D.h"

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// マクロ定義
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// 背景クラス定義
class CTutorialOKSign : public CObject2D
{
public:

	CTutorialOKSign(int nPriority = 7);
	~CTutorialOKSign();

	static CTutorialOKSign *Create(void);

	// オーバーライドされた関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

private:
	
	// メンバ関数

	// メンバ変数
	int m_nCntMove;			// 移動時間
	static int m_nTexIdx;	// テクスチャのインデックス番号
};



#endif